ranjithaguna/pv/LED_Demo/source/pic32cx/component/ec_reg_bank.h
/**
 * \brief Component description for PIC32CX/0525SG12 EC_REG_BANK
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_EC_REG_BANK_COMPONENT_H_
#define _PIC32CX_0525SG12_EC_REG_BANK_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_EC_REG_BANK This block is designed to be accessed internally by the EC via the register interface.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EC_REG_BANK */
/* ========================================================================== */

/* -------- EC_REG_BANK_AHB_ERROR_ADDRESS : (EC_REG_BANK Offset: 0x04) (R/W 32) AHB Error Address [0:0] AHB_ERR_ADDR, In priority order:\n     1. AHB address is registered when an AHB error occurs on the processor's AHB master port and the register value was\n     already 0. This way only the first address to generate an exception is captured.\n     2. The processor can clear this register by writing any 32-bit value to this register. -------- */

typedef union
{
  uint32_t w;
} __EC_REG_BANK_AHB_ERROR_ADDRESS_bits_t;
#define EC_REG_BANK_AHB_ERROR_ADDRESS_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_AHB_ERROR_ADDRESS) AHB Error Address [0:0] AHB_ERR_ADDR, In priority order:\n     1. AHB address is registered when an AHB error occurs on the processor's AHB master port and the register value was\n     already 0. This way only the first address to generate an exception is captured.\n     2. The processor can clear this register by writing any 32-bit value to this register.  Reset Value */

#define EC_REG_BANK_AHB_ERROR_ADDRESS_Msk     (0x00000000UL)                                 /**< (EC_REG_BANK_AHB_ERROR_ADDRESS) Register Mask  */

/* -------- EC_REG_BANK_AHB_ERROR_CONTROL : (EC_REG_BANK Offset: 0x14) (R/W 8) AHB Error Control [0:0] AHB_ERROR_DISABLE, 0: EC memory exceptions are enabled. 1: EC memory exceptions are disabled. -------- */

typedef union
{
  uint8_t  w;
} __EC_REG_BANK_AHB_ERROR_CONTROL_bits_t;
#define EC_REG_BANK_AHB_ERROR_CONTROL_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_AHB_ERROR_CONTROL) AHB Error Control [0:0] AHB_ERROR_DISABLE, 0: EC memory exceptions are enabled. 1: EC memory exceptions are disabled.  Reset Value */

#define EC_REG_BANK_AHB_ERROR_CONTROL_Msk     (0x00000000UL)                                 /**< (EC_REG_BANK_AHB_ERROR_CONTROL) Register Mask  */

/* -------- EC_REG_BANK_INTERRUPT_CONTROL : (EC_REG_BANK Offset: 0x18) (R/W 32) Interrupt Control [0:0] NVIC_EN (NVIC_EN) This bit enables Alternate NVIC IRQ's Vectors. The Alternate NVIC Vectors provides each interrupt event with a dedicated (direct) NVIC vector.\n            0 = Alternate NVIC vectors disabled, 1= Alternate NVIC vectors enabled -------- */

typedef union
{
  uint32_t w;
} __EC_REG_BANK_INTERRUPT_CONTROL_bits_t;
#define EC_REG_BANK_INTERRUPT_CONTROL_RESETVALUE (0x01U)                                       /**<  (EC_REG_BANK_INTERRUPT_CONTROL) Interrupt Control [0:0] NVIC_EN (NVIC_EN) This bit enables Alternate NVIC IRQ's Vectors. The Alternate NVIC Vectors provides each interrupt event with a dedicated (direct) NVIC vector.\n            0 = Alternate NVIC vectors disabled, 1= Alternate NVIC vectors enabled  Reset Value */

#define EC_REG_BANK_INTERRUPT_CONTROL_Msk     (0x00000000UL)                                 /**< (EC_REG_BANK_INTERRUPT_CONTROL) Register Mask  */

/* -------- EC_REG_BANK_ETM_TRACE_ENABLE : (EC_REG_BANK Offset: 0x1c) (R/W 32) ETM TRACE Enable [0:0] TRACE_EN (TRACE_EN) This bit enables the ARM TRACE debug port (ETM/ITM). The Trace Debug Interface pins are forced to the TRACE functions.            0 = ARM TRACE port disabled, 1= ARM TRACE port enabled -------- */

typedef union
{
  uint32_t w;
} __EC_REG_BANK_ETM_TRACE_ENABLE_bits_t;
#define EC_REG_BANK_ETM_TRACE_ENABLE_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_ETM_TRACE_ENABLE) ETM TRACE Enable [0:0] TRACE_EN (TRACE_EN) This bit enables the ARM TRACE debug port (ETM/ITM). The Trace Debug Interface pins are forced to the TRACE functions.            0 = ARM TRACE port disabled, 1= ARM TRACE port enabled  Reset Value */

#define EC_REG_BANK_ETM_TRACE_ENABLE_Msk      (0x00000000UL)                                 /**< (EC_REG_BANK_ETM_TRACE_ENABLE) Register Mask  */

/* -------- EC_REG_BANK_DEBUG_Enable : (EC_REG_BANK Offset: 0x20) (R/W 32) Debug Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t DEBUG_EN:1;                /**< bit:      0  DEBUG_EN (JTAG_EN) This bit enables the JTAG/SWD debug port.\n               0= JTAG/SWD port disabled. JTAG/SWD cannot be enabled (i.e., the TRST# pin is ignored and the JTAG signals remain in their non-JTAG state)\n               1= JTAG/SWD port enabled. A high on TRST# enables JTAG or SWD, as determined by SWD_EN. */
    uint32_t DEBUG_PIN_CFG:2;           /**< bit:   1..2  This field determines which pins are affected by the TRST# debug enable pin.\n      3=Reserved\n      2=The pins associated with the JTAG TCK and TMS switch to the debug interface when TRST# is de-asserted high. The pins\n      associated with TDI and TDO remain controlled by the associated GPIO. This setting should be used when the ARM Serial\n      Wire Debug (SWD) is required for debugging and the Serial Wire Viewer is not required\n      1=The pins associated with the JTAG TCK, TMS and TDO switch to the debug interface when TRST# is de-asserted high. The pin\n      associated with TDI remains controlled by the associated GPIO. This setting should be used when the ARM Serial Wire Debug\n      (SWD) and Serial Wire Viewer (SWV) are both required for debugging\n      0=All four pins associated with JTAG (TCK, TMS, TDI and TDO) switch to the debug interface when TRST# is de-asserted high.\n      This setting should be used when the JTAG TAP controller is required for debugging. */
    uint32_t DEBUG_PU_EN:1;             /**< bit:      3  If this bit is set to '1b' internal pull-up resistors are automatically enabled on the appropriate debugging port\n      wires whenever the debug port is enabled (the DEBUG_EN bit in this register is '1b' and the JTAG_RST# pin is high). The setting\n      of DEBUG_PIN_CFG determines which pins have pull-ups enabled when the debug port is enabled. */
    uint32_t BSP_EN:1;                  /**< bit:      4  This bit sets the boundary scan tap controller accessibility from JTAG port.\n         1= Boundary scan tap controller accessibile through JTAG Port.\n         0= Boundary scan tap controller not accessibile through JTAG Port.\n */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_DEBUG_Enable_bits_t;
#define EC_REG_BANK_DEBUG_Enable_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_DEBUG_Enable) Debug Enable Register  Reset Value */

#define EC_REG_BANK_DEBUG_Enable_DEBUG_EN_Pos (0)                                            /**< (EC_REG_BANK_DEBUG_Enable) DEBUG_EN (JTAG_EN) This bit enables the JTAG/SWD debug port.\n               0= JTAG/SWD port disabled. JTAG/SWD cannot be enabled (i.e., the TRST# pin is ignored and the JTAG signals remain in their non-JTAG state)\n               1= JTAG/SWD port enabled. A high on TRST# enables JTAG or SWD, as determined by SWD_EN. Position */
#define EC_REG_BANK_DEBUG_Enable_DEBUG_EN_Msk (0x1U << EC_REG_BANK_DEBUG_Enable_DEBUG_EN_Pos)  /**< (EC_REG_BANK_DEBUG_Enable) DEBUG_EN (JTAG_EN) This bit enables the JTAG/SWD debug port.\n               0= JTAG/SWD port disabled. JTAG/SWD cannot be enabled (i.e., the TRST# pin is ignored and the JTAG signals remain in their non-JTAG state)\n               1= JTAG/SWD port enabled. A high on TRST# enables JTAG or SWD, as determined by SWD_EN. Mask */
#define EC_REG_BANK_DEBUG_Enable_DEBUG_PIN_CFG_Pos (1)                                            /**< (EC_REG_BANK_DEBUG_Enable) This field determines which pins are affected by the TRST# debug enable pin.\n      3=Reserved\n      2=The pins associated with the JTAG TCK and TMS switch to the debug interface when TRST# is de-asserted high. The pins\n      associated with TDI and TDO remain controlled by the associated GPIO. This setting should be used when the ARM Serial\n      Wire Debug (SWD) is required for debugging and the Serial Wire Viewer is not required\n      1=The pins associated with the JTAG TCK, TMS and TDO switch to the debug interface when TRST# is de-asserted high. The pin\n      associated with TDI remains controlled by the associated GPIO. This setting should be used when the ARM Serial Wire Debug\n      (SWD) and Serial Wire Viewer (SWV) are both required for debugging\n      0=All four pins associated with JTAG (TCK, TMS, TDI and TDO) switch to the debug interface when TRST# is de-asserted high.\n      This setting should be used when the JTAG TAP controller is required for debugging. Position */
#define EC_REG_BANK_DEBUG_Enable_DEBUG_PIN_CFG_Msk (0x3U << EC_REG_BANK_DEBUG_Enable_DEBUG_PIN_CFG_Pos)  /**< (EC_REG_BANK_DEBUG_Enable) This field determines which pins are affected by the TRST# debug enable pin.\n      3=Reserved\n      2=The pins associated with the JTAG TCK and TMS switch to the debug interface when TRST# is de-asserted high. The pins\n      associated with TDI and TDO remain controlled by the associated GPIO. This setting should be used when the ARM Serial\n      Wire Debug (SWD) is required for debugging and the Serial Wire Viewer is not required\n      1=The pins associated with the JTAG TCK, TMS and TDO switch to the debug interface when TRST# is de-asserted high. The pin\n      associated with TDI remains controlled by the associated GPIO. This setting should be used when the ARM Serial Wire Debug\n      (SWD) and Serial Wire Viewer (SWV) are both required for debugging\n      0=All four pins associated with JTAG (TCK, TMS, TDI and TDO) switch to the debug interface when TRST# is de-asserted high.\n      This setting should be used when the JTAG TAP controller is required for debugging. Mask */
#define EC_REG_BANK_DEBUG_Enable_DEBUG_PIN_CFG(value) (EC_REG_BANK_DEBUG_Enable_DEBUG_PIN_CFG_Msk & ((value) << EC_REG_BANK_DEBUG_Enable_DEBUG_PIN_CFG_Pos))
#define EC_REG_BANK_DEBUG_Enable_DEBUG_PU_EN_Pos (3)                                            /**< (EC_REG_BANK_DEBUG_Enable) If this bit is set to '1b' internal pull-up resistors are automatically enabled on the appropriate debugging port\n      wires whenever the debug port is enabled (the DEBUG_EN bit in this register is '1b' and the JTAG_RST# pin is high). The setting\n      of DEBUG_PIN_CFG determines which pins have pull-ups enabled when the debug port is enabled. Position */
#define EC_REG_BANK_DEBUG_Enable_DEBUG_PU_EN_Msk (0x1U << EC_REG_BANK_DEBUG_Enable_DEBUG_PU_EN_Pos)  /**< (EC_REG_BANK_DEBUG_Enable) If this bit is set to '1b' internal pull-up resistors are automatically enabled on the appropriate debugging port\n      wires whenever the debug port is enabled (the DEBUG_EN bit in this register is '1b' and the JTAG_RST# pin is high). The setting\n      of DEBUG_PIN_CFG determines which pins have pull-ups enabled when the debug port is enabled. Mask */
#define EC_REG_BANK_DEBUG_Enable_BSP_EN_Pos   (4)                                            /**< (EC_REG_BANK_DEBUG_Enable) This bit sets the boundary scan tap controller accessibility from JTAG port.\n         1= Boundary scan tap controller accessibile through JTAG Port.\n         0= Boundary scan tap controller not accessibile through JTAG Port.\n Position */
#define EC_REG_BANK_DEBUG_Enable_BSP_EN_Msk   (0x1U << EC_REG_BANK_DEBUG_Enable_BSP_EN_Pos)  /**< (EC_REG_BANK_DEBUG_Enable) This bit sets the boundary scan tap controller accessibility from JTAG port.\n         1= Boundary scan tap controller accessibile through JTAG Port.\n         0= Boundary scan tap controller not accessibile through JTAG Port.\n Mask */
#define EC_REG_BANK_DEBUG_Enable_Msk          (0x0000001FUL)                                 /**< (EC_REG_BANK_DEBUG_Enable) Register Mask  */

/* -------- EC_REG_BANK_LOCK : (EC_REG_BANK Offset: 0x24) (R/W 32) Lock Register -------- */

typedef union
{
  struct
  {
    uint32_t TEST:1;                    /**< bit:      0  Test                                          */
    uint32_t VBAT_RAM_LOCK:1;           /**< bit:      1  VBAT RAM LOCK bit.\n         0 = Not Locked.\n         1 = Locked.\n */
    uint32_t VBAT_REG_LOCK:1;           /**< bit:      2  VBAT REG LOCK.\n         0 = Not Locked.\n         1 = Locked.\n */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_LOCK_bits_t;
#define EC_REG_BANK_LOCK_RESETVALUE         (0x00U)                                       /**<  (EC_REG_BANK_LOCK) Lock Register  Reset Value */

