ranjithaguna/pv/LED_Demo/source/pic32cx/component/ec_reg_bank.h
#define EC_REG_BANK_LOCK_TEST_Pos             (0)                                            /**< (EC_REG_BANK_LOCK) Test Position */
#define EC_REG_BANK_LOCK_TEST_Msk             (0x1U << EC_REG_BANK_LOCK_TEST_Pos)            /**< (EC_REG_BANK_LOCK) Test Mask */
#define EC_REG_BANK_LOCK_VBAT_RAM_LOCK_Pos    (1)                                            /**< (EC_REG_BANK_LOCK) VBAT RAM LOCK bit.\n         0 = Not Locked.\n         1 = Locked.\n Position */
#define EC_REG_BANK_LOCK_VBAT_RAM_LOCK_Msk    (0x1U << EC_REG_BANK_LOCK_VBAT_RAM_LOCK_Pos)   /**< (EC_REG_BANK_LOCK) VBAT RAM LOCK bit.\n         0 = Not Locked.\n         1 = Locked.\n Mask */
#define EC_REG_BANK_LOCK_VBAT_REG_LOCK_Pos    (2)                                            /**< (EC_REG_BANK_LOCK) VBAT REG LOCK.\n         0 = Not Locked.\n         1 = Locked.\n Position */
#define EC_REG_BANK_LOCK_VBAT_REG_LOCK_Msk    (0x1U << EC_REG_BANK_LOCK_VBAT_REG_LOCK_Pos)   /**< (EC_REG_BANK_LOCK) VBAT REG LOCK.\n         0 = Not Locked.\n         1 = Locked.\n Mask */
#define EC_REG_BANK_LOCK_Msk                  (0x00000007UL)                                 /**< (EC_REG_BANK_LOCK) Register Mask  */

/* -------- EC_REG_BANK_WDT_EVENT_COUNT : (EC_REG_BANK Offset: 0x28) (R/W 32) WDT Event Count [3:0] WDT_COUNT (WDT_COUNT) These EC R/W bits are cleared to 0 on VCC1 POR, but not on a WDT.\n            Note: This field is written by Boot ROM firmware to indicate the number of times a WDT fired before loading a good EC code image. -------- */

typedef union
{
  uint32_t w;
} __EC_REG_BANK_WDT_EVENT_COUNT_bits_t;
#define EC_REG_BANK_WDT_EVENT_COUNT_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_WDT_EVENT_COUNT) WDT Event Count [3:0] WDT_COUNT (WDT_COUNT) These EC R/W bits are cleared to 0 on VCC1 POR, but not on a WDT.\n            Note: This field is written by Boot ROM firmware to indicate the number of times a WDT fired before loading a good EC code image.  Reset Value */

#define EC_REG_BANK_WDT_EVENT_COUNT_Msk       (0x00000000UL)                                 /**< (EC_REG_BANK_WDT_EVENT_COUNT) Register Mask  */

/* -------- EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL : (EC_REG_BANK Offset: 0x2c) (R/W 32) AES HASH Byte Swap Control Register. -------- */

typedef union
{
  struct
  {
    uint32_t INPUT_BYTE_SWAP_ENABLE:1;  /**< bit:      0  Used to enable byte swap on a DWORD during AHB read from AES / HASH block: 1=Enable; 0=Disable. */
    uint32_t OUTPUT_BYTE_SWAP_ENABLE:1;  /**< bit:      1  Used to enable byte swap on a DWORD during AHB write from AES / HASH block: 1=Enable; 0=Disable. */
    uint32_t INPUT_BLOCK_SWAP_ENABLE:3;  /**< bit:   2..4  Used to enable word swap on a DWORD during AHB read from AES / HASH block\n      4=Swap 32-bit doublewords in 128-byte blocks\n      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...\n      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...\n      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n      0x0, 0xC, 0x8, ...\n      0=Disable. */
    uint32_t OUTPUT_BLOCK_SWAP_ENABLE:3;  /**< bit:   5..7  Used to enable word swap on a DWORD during AHB write from AES / HASH block\n      4=Swap 32-bit doublewords in 128-byte blocks\n      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...\n      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...\n      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n      0x0, 0xC, 0x8, ...\n      0=Disable. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_bits_t;
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) AES HASH Byte Swap Control Register.  Reset Value */

#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BYTE_SWAP_ENABLE_Pos (0)                                            /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable byte swap on a DWORD during AHB read from AES / HASH block: 1=Enable; 0=Disable. Position */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BYTE_SWAP_ENABLE_Msk (0x1U << EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BYTE_SWAP_ENABLE_Pos)  /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable byte swap on a DWORD during AHB read from AES / HASH block: 1=Enable; 0=Disable. Mask */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BYTE_SWAP_ENABLE_Pos (1)                                            /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable byte swap on a DWORD during AHB write from AES / HASH block: 1=Enable; 0=Disable. Position */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BYTE_SWAP_ENABLE_Msk (0x1U << EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BYTE_SWAP_ENABLE_Pos)  /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable byte swap on a DWORD during AHB write from AES / HASH block: 1=Enable; 0=Disable. Mask */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BLOCK_SWAP_ENABLE_Pos (2)                                            /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable word swap on a DWORD during AHB read from AES / HASH block\n      4=Swap 32-bit doublewords in 128-byte blocks\n      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...\n      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...\n      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n      0x0, 0xC, 0x8, ...\n      0=Disable. Position */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BLOCK_SWAP_ENABLE_Msk (0x7U << EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BLOCK_SWAP_ENABLE_Pos)  /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable word swap on a DWORD during AHB read from AES / HASH block\n      4=Swap 32-bit doublewords in 128-byte blocks\n      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...\n      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...\n      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n      0x0, 0xC, 0x8, ...\n      0=Disable. Mask */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BLOCK_SWAP_ENABLE(value) (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BLOCK_SWAP_ENABLE_Msk & ((value) << EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_INPUT_BLOCK_SWAP_ENABLE_Pos))
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BLOCK_SWAP_ENABLE_Pos (5)                                            /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable word swap on a DWORD during AHB write from AES / HASH block\n      4=Swap 32-bit doublewords in 128-byte blocks\n      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...\n      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...\n      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n      0x0, 0xC, 0x8, ...\n      0=Disable. Position */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BLOCK_SWAP_ENABLE_Msk (0x7U << EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BLOCK_SWAP_ENABLE_Pos)  /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Used to enable word swap on a DWORD during AHB write from AES / HASH block\n      4=Swap 32-bit doublewords in 128-byte blocks\n      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...\n      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...\n      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n      0x0, 0xC, 0x8, ...\n      0=Disable. Mask */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BLOCK_SWAP_ENABLE(value) (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BLOCK_SWAP_ENABLE_Msk & ((value) << EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OUTPUT_BLOCK_SWAP_ENABLE_Pos))
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_Msk (0x000000FFUL)                                 /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) Register Mask  */

