ranjithaguna/pv/LED_Demo/source/pic32cx/component/ec_reg_bank.h
/* -------- EC_REG_BANK_PECI_DISABLE : (EC_REG_BANK Offset: 0x40) (R/W 32) PECI Disable -------- */

typedef union
{
  struct
  {
    uint32_t PECI_DISABLE:1;            /**< bit:      0  When this bit is asserted ('1'), it disables the PECI pads to reduce leakage. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_PECI_DISABLE_bits_t;
#define EC_REG_BANK_PECI_DISABLE_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_PECI_DISABLE) PECI Disable  Reset Value */

#define EC_REG_BANK_PECI_DISABLE_PECI_DISABLE_Pos (0)                                            /**< (EC_REG_BANK_PECI_DISABLE) When this bit is asserted ('1'), it disables the PECI pads to reduce leakage. Position */
#define EC_REG_BANK_PECI_DISABLE_PECI_DISABLE_Msk (0x1U << EC_REG_BANK_PECI_DISABLE_PECI_DISABLE_Pos)  /**< (EC_REG_BANK_PECI_DISABLE) When this bit is asserted ('1'), it disables the PECI pads to reduce leakage. Mask */
#define EC_REG_BANK_PECI_DISABLE_Msk          (0x00000001UL)                                 /**< (EC_REG_BANK_PECI_DISABLE) Register Mask  */

/* -------- EC_REG_BANK_STM_REG : (EC_REG_BANK Offset: 0x4c) (R/ 32) This register is a mirror of the Boot Control Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t QA_MODE:1;                 /**< bit:      0  This is the mirror of the QA_MODE (bit 0) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the QA mode.\n */
    uint32_t VLD_MODE:1;                /**< bit:      1  This is the mirror of the Validation MODE (bit 1) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the Validation mode.\n */
    uint32_t BS_STATUS:1;               /**< bit:      2  This register bit tells BOOT ROM about the Boundary Scan Status.\n */
    uint32_t INT_SPI_RECOV:1;           /**< bit:      3  This register bit tells BOOT ROM that SPI FLASH Recovery Mode is entered.\n */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_STM_REG_bits_t;
#define EC_REG_BANK_STM_REG_RESETVALUE      (0x00U)                                       /**<  (EC_REG_BANK_STM_REG) This register is a mirror of the Boot Control Register.\n  Reset Value */

#define EC_REG_BANK_STM_REG_QA_MODE_Pos       (0)                                            /**< (EC_REG_BANK_STM_REG) This is the mirror of the QA_MODE (bit 0) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the QA mode.\n Position */
#define EC_REG_BANK_STM_REG_QA_MODE_Msk       (0x1U << EC_REG_BANK_STM_REG_QA_MODE_Pos)      /**< (EC_REG_BANK_STM_REG) This is the mirror of the QA_MODE (bit 0) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the QA mode.\n Mask */
#define EC_REG_BANK_STM_REG_VLD_MODE_Pos      (1)                                            /**< (EC_REG_BANK_STM_REG) This is the mirror of the Validation MODE (bit 1) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the Validation mode.\n Position */
#define EC_REG_BANK_STM_REG_VLD_MODE_Msk      (0x1U << EC_REG_BANK_STM_REG_VLD_MODE_Pos)     /**< (EC_REG_BANK_STM_REG) This is the mirror of the Validation MODE (bit 1) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the Validation mode.\n Mask */
#define EC_REG_BANK_STM_REG_BS_STATUS_Pos     (2)                                            /**< (EC_REG_BANK_STM_REG) This register bit tells BOOT ROM about the Boundary Scan Status.\n Position */
#define EC_REG_BANK_STM_REG_BS_STATUS_Msk     (0x1U << EC_REG_BANK_STM_REG_BS_STATUS_Pos)    /**< (EC_REG_BANK_STM_REG) This register bit tells BOOT ROM about the Boundary Scan Status.\n Mask */
#define EC_REG_BANK_STM_REG_INT_SPI_RECOV_Pos (3)                                            /**< (EC_REG_BANK_STM_REG) This register bit tells BOOT ROM that SPI FLASH Recovery Mode is entered.\n Position */
#define EC_REG_BANK_STM_REG_INT_SPI_RECOV_Msk (0x1U << EC_REG_BANK_STM_REG_INT_SPI_RECOV_Pos)  /**< (EC_REG_BANK_STM_REG) This register bit tells BOOT ROM that SPI FLASH Recovery Mode is entered.\n Mask */
#define EC_REG_BANK_STM_REG_Msk               (0x0000000FUL)                                 /**< (EC_REG_BANK_STM_REG) Register Mask  */

/* -------- EC_REG_BANK_VCI_FWOVRD : (EC_REG_BANK Offset: 0x50) (R/W 32) This register contains the system shutdown bit programmable by Firmware.\n -------- */

typedef union
{
  struct
  {
    uint32_t VCI_FW_OVRD:1;             /**< bit:      0  This register contains the active low system shutdown bit programmable by Firmware.\n */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_VCI_FWOVRD_bits_t;
#define EC_REG_BANK_VCI_FWOVRD_RESETVALUE   (0x01U)                                       /**<  (EC_REG_BANK_VCI_FWOVRD) This register contains the system shutdown bit programmable by Firmware.\n  Reset Value */

#define EC_REG_BANK_VCI_FWOVRD_VCI_FW_OVRD_Pos (0)                                            /**< (EC_REG_BANK_VCI_FWOVRD) This register contains the active low system shutdown bit programmable by Firmware.\n Position */
#define EC_REG_BANK_VCI_FWOVRD_VCI_FW_OVRD_Msk (0x1U << EC_REG_BANK_VCI_FWOVRD_VCI_FW_OVRD_Pos)  /**< (EC_REG_BANK_VCI_FWOVRD) This register contains the active low system shutdown bit programmable by Firmware.\n Mask */
#define EC_REG_BANK_VCI_FWOVRD_Msk            (0x00000001UL)                                 /**< (EC_REG_BANK_VCI_FWOVRD) Register Mask  */

/* -------- EC_REG_BANK_VTR_RSTBR_STAT : (EC_REG_BANK Offset: 0x54) (R/W 8) This register contains the VTR Reset Status for BOOT ROM.\n -------- */

typedef union
{
  struct
  {
    uint8_t  RST_SYS_STAT:1;            /**< bit:      0  This bit contains the RESET_SYS Status for BOOT ROM usage.\n         1= RESET_SYS event occured.\n         0= RESET_SYS event did not occured.\n         This registe is R/W1C (read / write 1 to clear). */
    uint8_t  WDT_STAT:1;                /**< bit:      1  This bit contains the WDT Event Status for BOOT ROM usage.\n         1= WDT event occured.\n         0= WDT event did not occured.\n         This registe is R/W1C (read / write 1 to clear). */
    uint8_t  :6;                        /**< bit:   2..7  Reserved                                      */
  };
  uint8_t  w;
} __EC_REG_BANK_VTR_RSTBR_STAT_bits_t;
#define EC_REG_BANK_VTR_RSTBR_STAT_RESETVALUE (0x01U)                                       /**<  (EC_REG_BANK_VTR_RSTBR_STAT) This register contains the VTR Reset Status for BOOT ROM.\n  Reset Value */

#define EC_REG_BANK_VTR_RSTBR_STAT_RST_SYS_STAT_Pos (0)                                            /**< (EC_REG_BANK_VTR_RSTBR_STAT) This bit contains the RESET_SYS Status for BOOT ROM usage.\n         1= RESET_SYS event occured.\n         0= RESET_SYS event did not occured.\n         This registe is R/W1C (read / write 1 to clear). Position */
#define EC_REG_BANK_VTR_RSTBR_STAT_RST_SYS_STAT_Msk (0x1U << EC_REG_BANK_VTR_RSTBR_STAT_RST_SYS_STAT_Pos)  /**< (EC_REG_BANK_VTR_RSTBR_STAT) This bit contains the RESET_SYS Status for BOOT ROM usage.\n         1= RESET_SYS event occured.\n         0= RESET_SYS event did not occured.\n         This registe is R/W1C (read / write 1 to clear). Mask */
#define EC_REG_BANK_VTR_RSTBR_STAT_WDT_STAT_Pos (1)                                            /**< (EC_REG_BANK_VTR_RSTBR_STAT) This bit contains the WDT Event Status for BOOT ROM usage.\n         1= WDT event occured.\n         0= WDT event did not occured.\n         This registe is R/W1C (read / write 1 to clear). Position */
#define EC_REG_BANK_VTR_RSTBR_STAT_WDT_STAT_Msk (0x1U << EC_REG_BANK_VTR_RSTBR_STAT_WDT_STAT_Pos)  /**< (EC_REG_BANK_VTR_RSTBR_STAT) This bit contains the WDT Event Status for BOOT ROM usage.\n         1= WDT event occured.\n         0= WDT event did not occured.\n         This registe is R/W1C (read / write 1 to clear). Mask */
#define EC_REG_BANK_VTR_RSTBR_STAT_Msk        (0x00000003UL)                                 /**< (EC_REG_BANK_VTR_RSTBR_STAT) Register Mask  */

/* -------- EC_REG_BANK_CRYPTO_SOFT_RESET : (EC_REG_BANK Offset: 0x5c) (R/W 32) System Shutdown Reset -------- */

typedef union
{
  struct
  {
    uint32_t RNG_SOFT_RESET:1;          /**< bit:      0  When this bit is asserted ('1'), the Random Number Generator block is reset. */
    uint32_t PUBLIC_KEY_SOFT_RESET:1;   /**< bit:      1  When this bit is asserted ('1'), the Public Key block is reset. */
    uint32_t AES_HASH_SOFT_RESET:1;     /**< bit:      2  When this bit is asserted ('1'), the AES and Hash blocks are reset. */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_CRYPTO_SOFT_RESET_bits_t;
#define EC_REG_BANK_CRYPTO_SOFT_RESET_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_CRYPTO_SOFT_RESET) System Shutdown Reset  Reset Value */

#define EC_REG_BANK_CRYPTO_SOFT_RESET_RNG_SOFT_RESET_Pos (0)                                            /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) When this bit is asserted ('1'), the Random Number Generator block is reset. Position */
#define EC_REG_BANK_CRYPTO_SOFT_RESET_RNG_SOFT_RESET_Msk (0x1U << EC_REG_BANK_CRYPTO_SOFT_RESET_RNG_SOFT_RESET_Pos)  /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) When this bit is asserted ('1'), the Random Number Generator block is reset. Mask */
#define EC_REG_BANK_CRYPTO_SOFT_RESET_PUBLIC_KEY_SOFT_RESET_Pos (1)                                            /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) When this bit is asserted ('1'), the Public Key block is reset. Position */
#define EC_REG_BANK_CRYPTO_SOFT_RESET_PUBLIC_KEY_SOFT_RESET_Msk (0x1U << EC_REG_BANK_CRYPTO_SOFT_RESET_PUBLIC_KEY_SOFT_RESET_Pos)  /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) When this bit is asserted ('1'), the Public Key block is reset. Mask */
#define EC_REG_BANK_CRYPTO_SOFT_RESET_AES_HASH_SOFT_RESET_Pos (2)                                            /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) When this bit is asserted ('1'), the AES and Hash blocks are reset. Position */
#define EC_REG_BANK_CRYPTO_SOFT_RESET_AES_HASH_SOFT_RESET_Msk (0x1U << EC_REG_BANK_CRYPTO_SOFT_RESET_AES_HASH_SOFT_RESET_Pos)  /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) When this bit is asserted ('1'), the AES and Hash blocks are reset. Mask */
#define EC_REG_BANK_CRYPTO_SOFT_RESET_Msk     (0x00000007UL)                                 /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) Register Mask  */

/* -------- EC_REG_BANK_GPIO_BANK_POWER : (EC_REG_BANK Offset: 0x64) (R/W 32) GPIO Bank Power Register -------- */

typedef union
{
  struct
  {
    uint32_t TEST:1;                    /**< bit:      0  This bit must be programmed to 0h for proper operation of the device.\n */
    uint32_t VTR_LEVEL2:1;              /**< bit:      1  Voltage value on VTR2. This bit is set by Firmware after a VTR Power On Reset.\n         It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted.\n         Write access is determined by bit 7.\n      1=VTR2 is powered by 1.8V\n      0=VTR2 is powered by 3.3V. */
    uint32_t VTR_LEVEL3:1;              /**< bit:      2  Voltage value on VTR3. This bit is set by hardware after a VTR Power On Reset, but may be overridden by software.\n      It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted. Write access is determined by bit 7.\n      1=VTR3 is powered by 1.8V\n      0=VTR3 is powered by 3.3V. */
    uint32_t :4;                        /**< bit:   3..6  Reserved                                      */
    uint32_t GPIO_BANK_POWER_LOCK:1;    /**< bit:      7  GPIO Bank Power Lock. 0: VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are R/W\n      1 = VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are Read Only. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t VTR_LEVEL:2;               /**< bit:   1..2  Voltage value on VTR2. This bit is set by Firmware after a VTR Power On Reset.\n         It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted.\n         Write access is determined by bit 7.\n      x=VTR2 is powered by x.8V\n      x=VTR2 is powered by 3.3V. */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_GPIO_BANK_POWER_bits_t;
#define EC_REG_BANK_GPIO_BANK_POWER_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_GPIO_BANK_POWER) GPIO Bank Power Register  Reset Value */

#define EC_REG_BANK_GPIO_BANK_POWER_TEST_Pos  (0)                                            /**< (EC_REG_BANK_GPIO_BANK_POWER) This bit must be programmed to 0h for proper operation of the device.\n Position */
#define EC_REG_BANK_GPIO_BANK_POWER_TEST_Msk  (0x1U << EC_REG_BANK_GPIO_BANK_POWER_TEST_Pos)  /**< (EC_REG_BANK_GPIO_BANK_POWER) This bit must be programmed to 0h for proper operation of the device.\n Mask */
#define EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL2_Pos (1)                                            /**< (EC_REG_BANK_GPIO_BANK_POWER) Voltage value on VTR2. This bit is set by Firmware after a VTR Power On Reset.\n         It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted.\n         Write access is determined by bit 7.\n      1=VTR2 is powered by 1.8V\n      0=VTR2 is powered by 3.3V. Position */
#define EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL2_Msk (0x1U << EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL2_Pos)  /**< (EC_REG_BANK_GPIO_BANK_POWER) Voltage value on VTR2. This bit is set by Firmware after a VTR Power On Reset.\n         It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted.\n         Write access is determined by bit 7.\n      1=VTR2 is powered by 1.8V\n      0=VTR2 is powered by 3.3V. Mask */
#define EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL3_Pos (2)                                            /**< (EC_REG_BANK_GPIO_BANK_POWER) Voltage value on VTR3. This bit is set by hardware after a VTR Power On Reset, but may be overridden by software.\n      It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted. Write access is determined by bit 7.\n      1=VTR3 is powered by 1.8V\n      0=VTR3 is powered by 3.3V. Position */
#define EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL3_Msk (0x1U << EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL3_Pos)  /**< (EC_REG_BANK_GPIO_BANK_POWER) Voltage value on VTR3. This bit is set by hardware after a VTR Power On Reset, but may be overridden by software.\n      It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted. Write access is determined by bit 7.\n      1=VTR3 is powered by 1.8V\n      0=VTR3 is powered by 3.3V. Mask */
#define EC_REG_BANK_GPIO_BANK_POWER_GPIO_BANK_POWER_LOCK_Pos (7)                                            /**< (EC_REG_BANK_GPIO_BANK_POWER) GPIO Bank Power Lock. 0: VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are R/W\n      1 = VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are Read Only. Position */
#define EC_REG_BANK_GPIO_BANK_POWER_GPIO_BANK_POWER_LOCK_Msk (0x1U << EC_REG_BANK_GPIO_BANK_POWER_GPIO_BANK_POWER_LOCK_Pos)  /**< (EC_REG_BANK_GPIO_BANK_POWER) GPIO Bank Power Lock. 0: VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are R/W\n      1 = VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are Read Only. Mask */
#define EC_REG_BANK_GPIO_BANK_POWER_Msk       (0x00000087UL)                                 /**< (EC_REG_BANK_GPIO_BANK_POWER) Register Mask  */
#define EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL_Pos (1)                                            /**< (EC_REG_BANK_GPIO_BANK_POWER Position) Voltage value on VTR2. This bit is set by Firmware after a VTR Power On Reset.\n         It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted.\n         Write access is determined by bit 7.\n      x=VTR2 is powered by x.8V\n      x=VTR2 is powered by 3.3V. */
#define EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL_Msk (0x3U << EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL_Pos)  /**< (EC_REG_BANK_GPIO_BANK_POWER Mask) VTR_LEVEL */
#define EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL(value) (EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL_Msk & ((value) << EC_REG_BANK_GPIO_BANK_POWER_VTR_LEVEL_Pos))

/* -------- EC_REG_BANK_JTAG_MASTER_CFG : (EC_REG_BANK Offset: 0x70) (R/W 32) JTAG Master Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t JTM_CLK:3;                 /**< bit:   0..2  This field determines the JTAG Master clock rate, derived from the 48MHz master clock.\n      7=375KHz; 6=750KHz; 5=1.5Mhz; 4=3Mhz; 3=6Mhz; 2=12Mhz; 1=24MHz; 0=Reserved. */
    uint32_t MASTER_SLAVE:1;            /**< bit:      3  This bit controls the direction of the JTAG port. 1=The JTAG Port is configured as a Master\n      0=The JTAG Port is configures as a Slave. */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_JTAG_MASTER_CFG_bits_t;
#define EC_REG_BANK_JTAG_MASTER_CFG_RESETVALUE (0x03U)                                       /**<  (EC_REG_BANK_JTAG_MASTER_CFG) JTAG Master Configuration Register  Reset Value */

#define EC_REG_BANK_JTAG_MASTER_CFG_JTM_CLK_Pos (0)                                            /**< (EC_REG_BANK_JTAG_MASTER_CFG) This field determines the JTAG Master clock rate, derived from the 48MHz master clock.\n      7=375KHz; 6=750KHz; 5=1.5Mhz; 4=3Mhz; 3=6Mhz; 2=12Mhz; 1=24MHz; 0=Reserved. Position */
#define EC_REG_BANK_JTAG_MASTER_CFG_JTM_CLK_Msk (0x7U << EC_REG_BANK_JTAG_MASTER_CFG_JTM_CLK_Pos)  /**< (EC_REG_BANK_JTAG_MASTER_CFG) This field determines the JTAG Master clock rate, derived from the 48MHz master clock.\n      7=375KHz; 6=750KHz; 5=1.5Mhz; 4=3Mhz; 3=6Mhz; 2=12Mhz; 1=24MHz; 0=Reserved. Mask */
#define EC_REG_BANK_JTAG_MASTER_CFG_JTM_CLK(value) (EC_REG_BANK_JTAG_MASTER_CFG_JTM_CLK_Msk & ((value) << EC_REG_BANK_JTAG_MASTER_CFG_JTM_CLK_Pos))
#define EC_REG_BANK_JTAG_MASTER_CFG_MASTER_SLAVE_Pos (3)                                            /**< (EC_REG_BANK_JTAG_MASTER_CFG) This bit controls the direction of the JTAG port. 1=The JTAG Port is configured as a Master\n      0=The JTAG Port is configures as a Slave. Position */
#define EC_REG_BANK_JTAG_MASTER_CFG_MASTER_SLAVE_Msk (0x1U << EC_REG_BANK_JTAG_MASTER_CFG_MASTER_SLAVE_Pos)  /**< (EC_REG_BANK_JTAG_MASTER_CFG) This bit controls the direction of the JTAG port. 1=The JTAG Port is configured as a Master\n      0=The JTAG Port is configures as a Slave. Mask */
#define EC_REG_BANK_JTAG_MASTER_CFG_Msk       (0x0000000FUL)                                 /**< (EC_REG_BANK_JTAG_MASTER_CFG) Register Mask  */

/* -------- EC_REG_BANK_JTAG_MASTER_STS : (EC_REG_BANK Offset: 0x74) (R/ 32) JTAG Master Status Register -------- */

typedef union
{
  struct
  {
    uint32_t JTM_DONE:1;                /**< bit:      0  This bit is set to '1b' when the JTAG Master Command Register is written. It becomes '0b' when shifting has completed.\n      Software can poll this bit to determine when a command has completed and it is therefore safe to remove the data in the JTAG Master TDO\n      Register and load new data into the JTAG Master TMS Register and the JTAG Master TDI Register. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_JTAG_MASTER_STS_bits_t;
