ranjithaguna/pv/LED_Demo/source/pic32cx/component/ec_reg_bank.h
#define EC_REG_BANK_JTAG_MASTER_STS_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_JTAG_MASTER_STS) JTAG Master Status Register  Reset Value */

#define EC_REG_BANK_JTAG_MASTER_STS_JTM_DONE_Pos (0)                                            /**< (EC_REG_BANK_JTAG_MASTER_STS) This bit is set to '1b' when the JTAG Master Command Register is written. It becomes '0b' when shifting has completed.\n      Software can poll this bit to determine when a command has completed and it is therefore safe to remove the data in the JTAG Master TDO\n      Register and load new data into the JTAG Master TMS Register and the JTAG Master TDI Register. Position */
#define EC_REG_BANK_JTAG_MASTER_STS_JTM_DONE_Msk (0x1U << EC_REG_BANK_JTAG_MASTER_STS_JTM_DONE_Pos)  /**< (EC_REG_BANK_JTAG_MASTER_STS) This bit is set to '1b' when the JTAG Master Command Register is written. It becomes '0b' when shifting has completed.\n      Software can poll this bit to determine when a command has completed and it is therefore safe to remove the data in the JTAG Master TDO\n      Register and load new data into the JTAG Master TMS Register and the JTAG Master TDI Register. Mask */
#define EC_REG_BANK_JTAG_MASTER_STS_Msk       (0x00000001UL)                                 /**< (EC_REG_BANK_JTAG_MASTER_STS) Register Mask  */

/* -------- EC_REG_BANK_JTAG_MASTER_TDO : (EC_REG_BANK Offset: 0x78) (R/W 32) JTAG Master TDO Register -------- */

typedef union
{
  struct
  {
    uint32_t JTM_TDO:32;                /**< bit:  0..31  When the JTAG Master Command Register is written, from 1 to 32 bits are shifted into this register, starting with bit 0,\n      from the JTAG_TDO pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. */
  };
  uint32_t w;
} __EC_REG_BANK_JTAG_MASTER_TDO_bits_t;
#define EC_REG_BANK_JTAG_MASTER_TDO_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_JTAG_MASTER_TDO) JTAG Master TDO Register  Reset Value */

#define EC_REG_BANK_JTAG_MASTER_TDO_JTM_TDO_Pos (0)                                            /**< (EC_REG_BANK_JTAG_MASTER_TDO) When the JTAG Master Command Register is written, from 1 to 32 bits are shifted into this register, starting with bit 0,\n      from the JTAG_TDO pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. Position */
#define EC_REG_BANK_JTAG_MASTER_TDO_JTM_TDO_Msk (0xFFFFFFFFU << EC_REG_BANK_JTAG_MASTER_TDO_JTM_TDO_Pos)  /**< (EC_REG_BANK_JTAG_MASTER_TDO) When the JTAG Master Command Register is written, from 1 to 32 bits are shifted into this register, starting with bit 0,\n      from the JTAG_TDO pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. Mask */
#define EC_REG_BANK_JTAG_MASTER_TDO_JTM_TDO(value) (EC_REG_BANK_JTAG_MASTER_TDO_JTM_TDO_Msk & ((value) << EC_REG_BANK_JTAG_MASTER_TDO_JTM_TDO_Pos))
#define EC_REG_BANK_JTAG_MASTER_TDO_Msk       (0xFFFFFFFFUL)                                 /**< (EC_REG_BANK_JTAG_MASTER_TDO) Register Mask  */

/* -------- EC_REG_BANK_JTAG_MASTER_TDI : (EC_REG_BANK Offset: 0x7c) (R/W 32) JTAG Master TDI Register -------- */

typedef union
{
  struct
  {
    uint32_t JTM_TDI:32;                /**< bit:  0..31  When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TDI pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. */
  };
  uint32_t w;
} __EC_REG_BANK_JTAG_MASTER_TDI_bits_t;
#define EC_REG_BANK_JTAG_MASTER_TDI_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_JTAG_MASTER_TDI) JTAG Master TDI Register  Reset Value */

#define EC_REG_BANK_JTAG_MASTER_TDI_JTM_TDI_Pos (0)                                            /**< (EC_REG_BANK_JTAG_MASTER_TDI) When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TDI pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. Position */
#define EC_REG_BANK_JTAG_MASTER_TDI_JTM_TDI_Msk (0xFFFFFFFFU << EC_REG_BANK_JTAG_MASTER_TDI_JTM_TDI_Pos)  /**< (EC_REG_BANK_JTAG_MASTER_TDI) When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TDI pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. Mask */
#define EC_REG_BANK_JTAG_MASTER_TDI_JTM_TDI(value) (EC_REG_BANK_JTAG_MASTER_TDI_JTM_TDI_Msk & ((value) << EC_REG_BANK_JTAG_MASTER_TDI_JTM_TDI_Pos))
#define EC_REG_BANK_JTAG_MASTER_TDI_Msk       (0xFFFFFFFFUL)                                 /**< (EC_REG_BANK_JTAG_MASTER_TDI) Register Mask  */

/* -------- EC_REG_BANK_JTAG_MASTER_TMS : (EC_REG_BANK Offset: 0x80) (R/W 32) JTAG Master TMS Register -------- */

typedef union
{
  struct
  {
    uint32_t JTM_TMS:32;                /**< bit:  0..31  When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TMS pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. */
  };
  uint32_t w;
} __EC_REG_BANK_JTAG_MASTER_TMS_bits_t;
#define EC_REG_BANK_JTAG_MASTER_TMS_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_JTAG_MASTER_TMS) JTAG Master TMS Register  Reset Value */

#define EC_REG_BANK_JTAG_MASTER_TMS_JTM_TMS_Pos (0)                                            /**< (EC_REG_BANK_JTAG_MASTER_TMS) When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TMS pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. Position */
#define EC_REG_BANK_JTAG_MASTER_TMS_JTM_TMS_Msk (0xFFFFFFFFU << EC_REG_BANK_JTAG_MASTER_TMS_JTM_TMS_Pos)  /**< (EC_REG_BANK_JTAG_MASTER_TMS) When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TMS pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register. Mask */
#define EC_REG_BANK_JTAG_MASTER_TMS_JTM_TMS(value) (EC_REG_BANK_JTAG_MASTER_TMS_JTM_TMS_Msk & ((value) << EC_REG_BANK_JTAG_MASTER_TMS_JTM_TMS_Pos))
#define EC_REG_BANK_JTAG_MASTER_TMS_Msk       (0xFFFFFFFFUL)                                 /**< (EC_REG_BANK_JTAG_MASTER_TMS) Register Mask  */

/* -------- EC_REG_BANK_JTAG_MASTER_CMD : (EC_REG_BANK Offset: 0x84) (R/W 32) JTAG Master Command Register -------- */

typedef union
{
  struct
  {
    uint32_t JTM_COUNT:5;               /**< bit:   0..4  If the JTAG Port is configured as a Master, writing this register starts clocking and shifting on the JTAG port. The JTAG\n      Master port will shift JTM_COUNT+1 times, so writing a '0h' will shift 1 bit, and writing '31h' will shift 32 bits. The signal JTAG_CLK\n      will cycle JTM_COUNT+1 times. The contents of the JTAG Master TMS Register and the JTAG Master TDI Register will be shifted out on\n      the falling edge of JTAG_CLK and the.JTAG Master TDO Register will get shifted in on the rising edge of JTAG_CLK.\n      If the JTAG Port is configured as a Slave, writing this register has no effect. */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __EC_REG_BANK_JTAG_MASTER_CMD_bits_t;
#define EC_REG_BANK_JTAG_MASTER_CMD_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_JTAG_MASTER_CMD) JTAG Master Command Register  Reset Value */

#define EC_REG_BANK_JTAG_MASTER_CMD_JTM_COUNT_Pos (0)                                            /**< (EC_REG_BANK_JTAG_MASTER_CMD) If the JTAG Port is configured as a Master, writing this register starts clocking and shifting on the JTAG port. The JTAG\n      Master port will shift JTM_COUNT+1 times, so writing a '0h' will shift 1 bit, and writing '31h' will shift 32 bits. The signal JTAG_CLK\n      will cycle JTM_COUNT+1 times. The contents of the JTAG Master TMS Register and the JTAG Master TDI Register will be shifted out on\n      the falling edge of JTAG_CLK and the.JTAG Master TDO Register will get shifted in on the rising edge of JTAG_CLK.\n      If the JTAG Port is configured as a Slave, writing this register has no effect. Position */
#define EC_REG_BANK_JTAG_MASTER_CMD_JTM_COUNT_Msk (0x1FU << EC_REG_BANK_JTAG_MASTER_CMD_JTM_COUNT_Pos)  /**< (EC_REG_BANK_JTAG_MASTER_CMD) If the JTAG Port is configured as a Master, writing this register starts clocking and shifting on the JTAG port. The JTAG\n      Master port will shift JTM_COUNT+1 times, so writing a '0h' will shift 1 bit, and writing '31h' will shift 32 bits. The signal JTAG_CLK\n      will cycle JTM_COUNT+1 times. The contents of the JTAG Master TMS Register and the JTAG Master TDI Register will be shifted out on\n      the falling edge of JTAG_CLK and the.JTAG Master TDO Register will get shifted in on the rising edge of JTAG_CLK.\n      If the JTAG Port is configured as a Slave, writing this register has no effect. Mask */
#define EC_REG_BANK_JTAG_MASTER_CMD_JTM_COUNT(value) (EC_REG_BANK_JTAG_MASTER_CMD_JTM_COUNT_Msk & ((value) << EC_REG_BANK_JTAG_MASTER_CMD_JTM_COUNT_Pos))
#define EC_REG_BANK_JTAG_MASTER_CMD_Msk       (0x0000001FUL)                                 /**< (EC_REG_BANK_JTAG_MASTER_CMD) Register Mask  */

