ranjithaguna/pv/LED_Demo/source/pic32cx/component/ec_reg_bank.h
/* -------- EC_REG_BANK_ANALOG_COMPCTRL : (EC_REG_BANK Offset: 0x94) (R/W 8) Comparator Enable -------- */

typedef union
{
  struct
  {
    uint8_t  COMP0ENABLE:1;             /**< bit:      0  Comparator 0 Enable         0: Disable Comparator for operation         1: Enable Comparator operation. */
    uint8_t  :1;                        /**< bit:      1  Reserved                                      */
    uint8_t  CONF0LCK:1;                /**< bit:      2  Comparator 0 Configuration Locked         0: Configuration Not Locked. Bits[2,0] are Read-Write         1: Configuration Locked. Bits[2,0] are Read-Only                  Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written         this bit becomes a read-only bit. */
    uint8_t  :1;                        /**< bit:      3  Reserved                                      */
    uint8_t  COMP1ENABLE:1;             /**< bit:      4  Comparator 1 Enable         0: Disable Comparator for operation         1: Enable Comparator operation. */
    uint8_t  :3;                        /**< bit:   5..7  Reserved                                      */
  };
  uint8_t  w;
} __EC_REG_BANK_ANALOG_COMPCTRL_bits_t;
#define EC_REG_BANK_ANALOG_COMPCTRL_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_ANALOG_COMPCTRL) Comparator Enable  Reset Value */

#define EC_REG_BANK_ANALOG_COMPCTRL_COMP0ENABLE_Pos (0)                                            /**< (EC_REG_BANK_ANALOG_COMPCTRL) Comparator 0 Enable         0: Disable Comparator for operation         1: Enable Comparator operation. Position */
#define EC_REG_BANK_ANALOG_COMPCTRL_COMP0ENABLE_Msk (0x1U << EC_REG_BANK_ANALOG_COMPCTRL_COMP0ENABLE_Pos)  /**< (EC_REG_BANK_ANALOG_COMPCTRL) Comparator 0 Enable         0: Disable Comparator for operation         1: Enable Comparator operation. Mask */
#define EC_REG_BANK_ANALOG_COMPCTRL_CONF0LCK_Pos (2)                                            /**< (EC_REG_BANK_ANALOG_COMPCTRL) Comparator 0 Configuration Locked         0: Configuration Not Locked. Bits[2,0] are Read-Write         1: Configuration Locked. Bits[2,0] are Read-Only                  Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written         this bit becomes a read-only bit. Position */
#define EC_REG_BANK_ANALOG_COMPCTRL_CONF0LCK_Msk (0x1U << EC_REG_BANK_ANALOG_COMPCTRL_CONF0LCK_Pos)  /**< (EC_REG_BANK_ANALOG_COMPCTRL) Comparator 0 Configuration Locked         0: Configuration Not Locked. Bits[2,0] are Read-Write         1: Configuration Locked. Bits[2,0] are Read-Only                  Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written         this bit becomes a read-only bit. Mask */
#define EC_REG_BANK_ANALOG_COMPCTRL_COMP1ENABLE_Pos (4)                                            /**< (EC_REG_BANK_ANALOG_COMPCTRL) Comparator 1 Enable         0: Disable Comparator for operation         1: Enable Comparator operation. Position */
#define EC_REG_BANK_ANALOG_COMPCTRL_COMP1ENABLE_Msk (0x1U << EC_REG_BANK_ANALOG_COMPCTRL_COMP1ENABLE_Pos)  /**< (EC_REG_BANK_ANALOG_COMPCTRL) Comparator 1 Enable         0: Disable Comparator for operation         1: Enable Comparator operation. Mask */
#define EC_REG_BANK_ANALOG_COMPCTRL_Msk       (0x00000015UL)                                 /**< (EC_REG_BANK_ANALOG_COMPCTRL) Register Mask  */

/* -------- EC_REG_BANK_ANLG_COM_SLEEPCTRL : (EC_REG_BANK Offset: 0x98) (R/W 8) Analog Comparator Sleep Control Register -------- */

typedef union
{
  struct
  {
    uint8_t  COMP0SLEEP_EN:1;           /**< bit:      0  Comparator 0 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n         Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written \n         this bit becomes a read-only bit.\n */
    uint8_t  COMP1SLEEP_EN:1;           /**< bit:      1  Comparator 1 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n */
    uint8_t  :6;                        /**< bit:   2..7  Reserved                                      */
  };
  uint8_t  w;
} __EC_REG_BANK_ANLG_COM_SLEEPCTRL_bits_t;
#define EC_REG_BANK_ANLG_COM_SLEEPCTRL_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_ANLG_COM_SLEEPCTRL) Analog Comparator Sleep Control Register  Reset Value */

#define EC_REG_BANK_ANLG_COM_SLEEPCTRL_COMP0SLEEP_EN_Pos (0)                                            /**< (EC_REG_BANK_ANLG_COM_SLEEPCTRL) Comparator 0 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n         Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written \n         this bit becomes a read-only bit.\n Position */
#define EC_REG_BANK_ANLG_COM_SLEEPCTRL_COMP0SLEEP_EN_Msk (0x1U << EC_REG_BANK_ANLG_COM_SLEEPCTRL_COMP0SLEEP_EN_Pos)  /**< (EC_REG_BANK_ANLG_COM_SLEEPCTRL) Comparator 0 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n         Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written \n         this bit becomes a read-only bit.\n Mask */
#define EC_REG_BANK_ANLG_COM_SLEEPCTRL_COMP1SLEEP_EN_Pos (1)                                            /**< (EC_REG_BANK_ANLG_COM_SLEEPCTRL) Comparator 1 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n Position */
#define EC_REG_BANK_ANLG_COM_SLEEPCTRL_COMP1SLEEP_EN_Msk (0x1U << EC_REG_BANK_ANLG_COM_SLEEPCTRL_COMP1SLEEP_EN_Pos)  /**< (EC_REG_BANK_ANLG_COM_SLEEPCTRL) Comparator 1 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n Mask */
#define EC_REG_BANK_ANLG_COM_SLEEPCTRL_Msk    (0x00000003UL)                                 /**< (EC_REG_BANK_ANLG_COM_SLEEPCTRL) Register Mask  */

/* -------- EC_REG_BANK_BROM_SCRATCH0 : (EC_REG_BANK Offset: 0x180) (R/W 32) BOOT ROM Scratch 0 Register -------- */

typedef union
{
  struct
  {
    uint32_t SCRATCH0:32;               /**< bit:  0..31  This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. */
  };
  uint32_t w;
} __EC_REG_BANK_BROM_SCRATCH0_bits_t;
#define EC_REG_BANK_BROM_SCRATCH0_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_BROM_SCRATCH0) BOOT ROM Scratch 0 Register  Reset Value */

#define EC_REG_BANK_BROM_SCRATCH0_SCRATCH0_Pos (0)                                            /**< (EC_REG_BANK_BROM_SCRATCH0) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Position */
#define EC_REG_BANK_BROM_SCRATCH0_SCRATCH0_Msk (0xFFFFFFFFU << EC_REG_BANK_BROM_SCRATCH0_SCRATCH0_Pos)  /**< (EC_REG_BANK_BROM_SCRATCH0) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Mask */
#define EC_REG_BANK_BROM_SCRATCH0_SCRATCH0(value) (EC_REG_BANK_BROM_SCRATCH0_SCRATCH0_Msk & ((value) << EC_REG_BANK_BROM_SCRATCH0_SCRATCH0_Pos))
#define EC_REG_BANK_BROM_SCRATCH0_Msk         (0xFFFFFFFFUL)                                 /**< (EC_REG_BANK_BROM_SCRATCH0) Register Mask  */

/* -------- EC_REG_BANK_BROM_SCRATCH1 : (EC_REG_BANK Offset: 0x184) (R/W 32) BOOT ROM Scratch 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t SCRATCH0:32;               /**< bit:  0..31  This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. */
  };
  uint32_t w;
} __EC_REG_BANK_BROM_SCRATCH1_bits_t;
