ranjithaguna/pv/LED_Demo/source/pic32cx/component/ec_reg_bank.h
#define EC_REG_BANK_BROM_SCRATCH1_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_BROM_SCRATCH1) BOOT ROM Scratch 1 Register  Reset Value */

#define EC_REG_BANK_BROM_SCRATCH1_SCRATCH0_Pos (0)                                            /**< (EC_REG_BANK_BROM_SCRATCH1) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Position */
#define EC_REG_BANK_BROM_SCRATCH1_SCRATCH0_Msk (0xFFFFFFFFU << EC_REG_BANK_BROM_SCRATCH1_SCRATCH0_Pos)  /**< (EC_REG_BANK_BROM_SCRATCH1) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Mask */
#define EC_REG_BANK_BROM_SCRATCH1_SCRATCH0(value) (EC_REG_BANK_BROM_SCRATCH1_SCRATCH0_Msk & ((value) << EC_REG_BANK_BROM_SCRATCH1_SCRATCH0_Pos))
#define EC_REG_BANK_BROM_SCRATCH1_Msk         (0xFFFFFFFFUL)                                 /**< (EC_REG_BANK_BROM_SCRATCH1) Register Mask  */

/* -------- EC_REG_BANK_BROM_SCRATCH2 : (EC_REG_BANK Offset: 0x188) (R/W 32) BOOT ROM Scratch 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t SCRATCH2:32;               /**< bit:  0..31  This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. */
  };
  uint32_t w;
} __EC_REG_BANK_BROM_SCRATCH2_bits_t;
#define EC_REG_BANK_BROM_SCRATCH2_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_BROM_SCRATCH2) BOOT ROM Scratch 2 Register  Reset Value */

#define EC_REG_BANK_BROM_SCRATCH2_SCRATCH2_Pos (0)                                            /**< (EC_REG_BANK_BROM_SCRATCH2) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Position */
#define EC_REG_BANK_BROM_SCRATCH2_SCRATCH2_Msk (0xFFFFFFFFU << EC_REG_BANK_BROM_SCRATCH2_SCRATCH2_Pos)  /**< (EC_REG_BANK_BROM_SCRATCH2) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Mask */
#define EC_REG_BANK_BROM_SCRATCH2_SCRATCH2(value) (EC_REG_BANK_BROM_SCRATCH2_SCRATCH2_Msk & ((value) << EC_REG_BANK_BROM_SCRATCH2_SCRATCH2_Pos))
#define EC_REG_BANK_BROM_SCRATCH2_Msk         (0xFFFFFFFFUL)                                 /**< (EC_REG_BANK_BROM_SCRATCH2) Register Mask  */

/* -------- EC_REG_BANK_iBROM_SCRATCH3 : (EC_REG_BANK Offset: 0x18c) (R/W 32) BOOT ROM Scratch 3 Register -------- */

typedef union
{
  struct
  {
    uint32_t SCRATCH3:32;               /**< bit:  0..31  This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. */
  };
  uint32_t w;
} __EC_REG_BANK_iBROM_SCRATCH3_bits_t;
#define EC_REG_BANK_iBROM_SCRATCH3_RESETVALUE (0x00U)                                       /**<  (EC_REG_BANK_iBROM_SCRATCH3) BOOT ROM Scratch 3 Register  Reset Value */

#define EC_REG_BANK_iBROM_SCRATCH3_SCRATCH3_Pos (0)                                            /**< (EC_REG_BANK_iBROM_SCRATCH3) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Position */
#define EC_REG_BANK_iBROM_SCRATCH3_SCRATCH3_Msk (0xFFFFFFFFU << EC_REG_BANK_iBROM_SCRATCH3_SCRATCH3_Pos)  /**< (EC_REG_BANK_iBROM_SCRATCH3) This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register. Mask */
#define EC_REG_BANK_iBROM_SCRATCH3_SCRATCH3(value) (EC_REG_BANK_iBROM_SCRATCH3_SCRATCH3_Msk & ((value) << EC_REG_BANK_iBROM_SCRATCH3_SCRATCH3_Pos))
#define EC_REG_BANK_iBROM_SCRATCH3_Msk        (0xFFFFFFFFUL)                                 /**< (EC_REG_BANK_iBROM_SCRATCH3) Register Mask  */

/** \brief EC_REG_BANK register offsets definitions */
#define EC_REG_BANK_AHB_ERROR_ADDRESS_OFFSET (0x04)         /**< (EC_REG_BANK_AHB_ERROR_ADDRESS) AHB Error Address [0:0] AHB_ERR_ADDR, In priority order:\n     1. AHB address is registered when an AHB error occurs on the processor's AHB master port and the register value was\n     already 0. This way only the first address to generate an exception is captured.\n     2. The processor can clear this register by writing any 32-bit value to this register. Offset */
#define EC_REG_BANK_AHB_ERROR_CONTROL_OFFSET (0x14)         /**< (EC_REG_BANK_AHB_ERROR_CONTROL) AHB Error Control [0:0] AHB_ERROR_DISABLE, 0: EC memory exceptions are enabled. 1: EC memory exceptions are disabled. Offset */
#define EC_REG_BANK_INTERRUPT_CONTROL_OFFSET (0x18)         /**< (EC_REG_BANK_INTERRUPT_CONTROL) Interrupt Control [0:0] NVIC_EN (NVIC_EN) This bit enables Alternate NVIC IRQ's Vectors. The Alternate NVIC Vectors provides each interrupt event with a dedicated (direct) NVIC vector.\n            0 = Alternate NVIC vectors disabled, 1= Alternate NVIC vectors enabled Offset */
#define EC_REG_BANK_ETM_TRACE_ENABLE_OFFSET (0x1C)         /**< (EC_REG_BANK_ETM_TRACE_ENABLE) ETM TRACE Enable [0:0] TRACE_EN (TRACE_EN) This bit enables the ARM TRACE debug port (ETM/ITM). The Trace Debug Interface pins are forced to the TRACE functions.            0 = ARM TRACE port disabled, 1= ARM TRACE port enabled Offset */
#define EC_REG_BANK_DEBUG_Enable_OFFSET (0x20)         /**< (EC_REG_BANK_DEBUG_Enable) Debug Enable Register Offset */
#define EC_REG_BANK_LOCK_OFFSET      (0x24)         /**< (EC_REG_BANK_LOCK) Lock Register Offset */
#define EC_REG_BANK_WDT_EVENT_COUNT_OFFSET (0x28)         /**< (EC_REG_BANK_WDT_EVENT_COUNT) WDT Event Count [3:0] WDT_COUNT (WDT_COUNT) These EC R/W bits are cleared to 0 on VCC1 POR, but not on a WDT.\n            Note: This field is written by Boot ROM firmware to indicate the number of times a WDT fired before loading a good EC code image. Offset */
#define EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_OFFSET (0x2C)         /**< (EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL) AES HASH Byte Swap Control Register. Offset */
#define EC_REG_BANK_PECI_DISABLE_OFFSET (0x40)         /**< (EC_REG_BANK_PECI_DISABLE) PECI Disable Offset */
#define EC_REG_BANK_STM_REG_OFFSET   (0x4C)         /**< (EC_REG_BANK_STM_REG) This register is a mirror of the Boot Control Register.\n Offset */
#define EC_REG_BANK_VCI_FWOVRD_OFFSET (0x50)         /**< (EC_REG_BANK_VCI_FWOVRD) This register contains the system shutdown bit programmable by Firmware.\n Offset */
#define EC_REG_BANK_VTR_RSTBR_STAT_OFFSET (0x54)         /**< (EC_REG_BANK_VTR_RSTBR_STAT) This register contains the VTR Reset Status for BOOT ROM.\n Offset */
#define EC_REG_BANK_CRYPTO_SOFT_RESET_OFFSET (0x5C)         /**< (EC_REG_BANK_CRYPTO_SOFT_RESET) System Shutdown Reset Offset */
#define EC_REG_BANK_GPIO_BANK_POWER_OFFSET (0x64)         /**< (EC_REG_BANK_GPIO_BANK_POWER) GPIO Bank Power Register Offset */
#define EC_REG_BANK_JTAG_MASTER_CFG_OFFSET (0x70)         /**< (EC_REG_BANK_JTAG_MASTER_CFG) JTAG Master Configuration Register Offset */
#define EC_REG_BANK_JTAG_MASTER_STS_OFFSET (0x74)         /**< (EC_REG_BANK_JTAG_MASTER_STS) JTAG Master Status Register Offset */
#define EC_REG_BANK_JTAG_MASTER_TDO_OFFSET (0x78)         /**< (EC_REG_BANK_JTAG_MASTER_TDO) JTAG Master TDO Register Offset */
#define EC_REG_BANK_JTAG_MASTER_TDI_OFFSET (0x7C)         /**< (EC_REG_BANK_JTAG_MASTER_TDI) JTAG Master TDI Register Offset */
#define EC_REG_BANK_JTAG_MASTER_TMS_OFFSET (0x80)         /**< (EC_REG_BANK_JTAG_MASTER_TMS) JTAG Master TMS Register Offset */
#define EC_REG_BANK_JTAG_MASTER_CMD_OFFSET (0x84)         /**< (EC_REG_BANK_JTAG_MASTER_CMD) JTAG Master Command Register Offset */
#define EC_REG_BANK_ANALOG_COMPCTRL_OFFSET (0x94)         /**< (EC_REG_BANK_ANALOG_COMPCTRL) Comparator Enable Offset */
#define EC_REG_BANK_ANLG_COM_SLEEPCTRL_OFFSET (0x98)         /**< (EC_REG_BANK_ANLG_COM_SLEEPCTRL) Analog Comparator Sleep Control Register Offset */
#define EC_REG_BANK_BROM_SCRATCH0_OFFSET (0x180)        /**< (EC_REG_BANK_BROM_SCRATCH0) BOOT ROM Scratch 0 Register Offset */
#define EC_REG_BANK_BROM_SCRATCH1_OFFSET (0x184)        /**< (EC_REG_BANK_BROM_SCRATCH1) BOOT ROM Scratch 1 Register Offset */
#define EC_REG_BANK_BROM_SCRATCH2_OFFSET (0x188)        /**< (EC_REG_BANK_BROM_SCRATCH2) BOOT ROM Scratch 2 Register Offset */
#define EC_REG_BANK_iBROM_SCRATCH3_OFFSET (0x18C)        /**< (EC_REG_BANK_iBROM_SCRATCH3) BOOT ROM Scratch 3 Register Offset */

