ranjithaguna/pv/LED_Demo/source/pic32cx/component/ec_reg_bank.h
/** \brief EC_REG_BANK register API structure */
typedef struct
{  /* This block is designed to be accessed internally by the EC via the register interface. */
  __IO  __EC_REG_BANK_AHB_ERROR_ADDRESS_bits_t AHB_ERROR_ADDRESS; /**< Offset: 0x04 (R/W  32) AHB Error Address [0:0] AHB_ERR_ADDR, In priority order:\n     1. AHB address is registered when an AHB error occurs on the processor's AHB master port and the register value was\n     already 0. This way only the first address to generate an exception is captured.\n     2. The processor can clear this register by writing any 32-bit value to this register. */
  __IO  __EC_REG_BANK_AHB_ERROR_CONTROL_bits_t AHB_ERROR_CONTROL; /**< Offset: 0x14 (R/W   8) AHB Error Control [0:0] AHB_ERROR_DISABLE, 0: EC memory exceptions are enabled. 1: EC memory exceptions are disabled. */
  __IO  __EC_REG_BANK_INTERRUPT_CONTROL_bits_t INTERRUPT_CONTROL; /**< Offset: 0x18 (R/W  32) Interrupt Control [0:0] NVIC_EN (NVIC_EN) This bit enables Alternate NVIC IRQ's Vectors. The Alternate NVIC Vectors provides each interrupt event with a dedicated (direct) NVIC vector.\n            0 = Alternate NVIC vectors disabled, 1= Alternate NVIC vectors enabled */
  __IO  __EC_REG_BANK_ETM_TRACE_ENABLE_bits_t ETM_TRACE_ENABLE; /**< Offset: 0x1C (R/W  32) ETM TRACE Enable [0:0] TRACE_EN (TRACE_EN) This bit enables the ARM TRACE debug port (ETM/ITM). The Trace Debug Interface pins are forced to the TRACE functions.            0 = ARM TRACE port disabled, 1= ARM TRACE port enabled */
  __IO  __EC_REG_BANK_DEBUG_Enable_bits_t DEBUG_Enable;  /**< Offset: 0x20 (R/W  32) Debug Enable Register */
  __IO  __EC_REG_BANK_LOCK_bits_t      LOCK;          /**< Offset: 0x24 (R/W  32) Lock Register */
  __IO  __EC_REG_BANK_WDT_EVENT_COUNT_bits_t WDT_EVENT_COUNT; /**< Offset: 0x28 (R/W  32) WDT Event Count [3:0] WDT_COUNT (WDT_COUNT) These EC R/W bits are cleared to 0 on VCC1 POR, but not on a WDT.\n            Note: This field is written by Boot ROM firmware to indicate the number of times a WDT fired before loading a good EC code image. */
  __IO  __EC_REG_BANK_AES_HASH_BYTE_SWAP_CONTROL_bits_t AES_HASH_BYTE_SWAP_CONTROL; /**< Offset: 0x2C (R/W  32) AES HASH Byte Swap Control Register. */
  __IO  __EC_REG_BANK_PECI_DISABLE_bits_t PECI_DISABLE;  /**< Offset: 0x40 (R/W  32) PECI Disable */
  __I   __EC_REG_BANK_STM_REG_bits_t   STM_REG;       /**< Offset: 0x4C (R/   32) This register is a mirror of the Boot Control Register.\n */
  __IO  __EC_REG_BANK_VCI_FWOVRD_bits_t VCI_FWOVRD;    /**< Offset: 0x50 (R/W  32) This register contains the system shutdown bit programmable by Firmware.\n */
  __IO  __EC_REG_BANK_VTR_RSTBR_STAT_bits_t VTR_RSTBR_STAT; /**< Offset: 0x54 (R/W   8) This register contains the VTR Reset Status for BOOT ROM.\n */
  __IO  __EC_REG_BANK_CRYPTO_SOFT_RESET_bits_t CRYPTO_SOFT_RESET; /**< Offset: 0x5C (R/W  32) System Shutdown Reset */
  __IO  __EC_REG_BANK_GPIO_BANK_POWER_bits_t GPIO_BANK_POWER; /**< Offset: 0x64 (R/W  32) GPIO Bank Power Register */
  __IO  __EC_REG_BANK_JTAG_MASTER_CFG_bits_t JTAG_MASTER_CFG; /**< Offset: 0x70 (R/W  32) JTAG Master Configuration Register */
  __I   __EC_REG_BANK_JTAG_MASTER_STS_bits_t JTAG_MASTER_STS; /**< Offset: 0x74 (R/   32) JTAG Master Status Register */
  __IO  __EC_REG_BANK_JTAG_MASTER_TDO_bits_t JTAG_MASTER_TDO; /**< Offset: 0x78 (R/W  32) JTAG Master TDO Register */
  __IO  __EC_REG_BANK_JTAG_MASTER_TDI_bits_t JTAG_MASTER_TDI; /**< Offset: 0x7C (R/W  32) JTAG Master TDI Register */
  __IO  __EC_REG_BANK_JTAG_MASTER_TMS_bits_t JTAG_MASTER_TMS; /**< Offset: 0x80 (R/W  32) JTAG Master TMS Register */
  __IO  __EC_REG_BANK_JTAG_MASTER_CMD_bits_t JTAG_MASTER_CMD; /**< Offset: 0x84 (R/W  32) JTAG Master Command Register */
  __IO  __EC_REG_BANK_ANALOG_COMPCTRL_bits_t ANALOG_COMPCTRL; /**< Offset: 0x94 (R/W   8) Comparator Enable */
  __IO  __EC_REG_BANK_ANLG_COM_SLEEPCTRL_bits_t ANLG_COM_SLEEPCTRL; /**< Offset: 0x98 (R/W   8) Analog Comparator Sleep Control Register */
  __IO  __EC_REG_BANK_BROM_SCRATCH0_bits_t BROM_SCRATCH0; /**< Offset: 0x180 (R/W  32) BOOT ROM Scratch 0 Register */
  __IO  __EC_REG_BANK_BROM_SCRATCH1_bits_t BROM_SCRATCH1; /**< Offset: 0x184 (R/W  32) BOOT ROM Scratch 1 Register */
  __IO  __EC_REG_BANK_BROM_SCRATCH2_bits_t BROM_SCRATCH2; /**< Offset: 0x188 (R/W  32) BOOT ROM Scratch 2 Register */
  __IO  __EC_REG_BANK_iBROM_SCRATCH3_bits_t iBROM_SCRATCH3; /**< Offset: 0x18C (R/W  32) BOOT ROM Scratch 3 Register */
} ecregbank_registers_t;
/** @}  end of This block is designed to be accessed internally by the EC via the register interface. */

#endif /* _PIC32CX_0525SG12_EC_REG_BANK_COMPONENT_H_ */
